//
//  AllMenu.swift
//  foodDice
//
//  Created by yook on 2023/02/20.
//

import SwiftUI

struct MenuArrayType : Identifiable
{
    var id = UUID()
    var name : String
}

var menuArr = ["라면", "삼겹살", "치킨", "쌀국수",
               "돈까스", "짜장면", "족발", "떡볶이",
               "초밥", "김밥", "햄버거", "짬뽕",
               "소고기", "반미", "만두", "냉면",
               "제육볶음", "칼국수", "타코", "해장국",
               "수제비", "생선구이", "라멘", "서브웨이",
               "쭈꾸미볶음", "편의점", "밥버거", "갈비탕",
               "우동", "순대국", "불고기", "낙지볶음",
               "순두부", "카레", "한솥", "김피탕"]

let initMenuArr = ["라면", "삼겹살", "치킨", "쌀국수",
                     "돈까스", "짜장면", "족발", "떡볶이",
                     "초밥", "김밥", "햄버거", "짬뽕",
                     "소고기", "반미", "만두", "냉면",
                     "제육볶음", "칼국수", "타코", "해장국",
                     "수제비", "생선구이", "라멘", "서브웨이",
                     "쭈꾸미볶음", "편의점", "밥버거", "갈비탕",
                     "우동", "순대국", "불고기", "낙지볶음",
                     "순두부", "카레", "한솥", "김피탕"]
